export default defineCameo({
    name: 'Карл Фридрих Гаусс',
    color: '#7c7c00',
    link: 'https://w.wiki/9SuP',
    messages: [
        'Математика — царица всех наук.',
        'Занимательное чтиво... Правда, я все это знал еще в возрасте трех лет.',
        'Я запрещал своим детям заниматься наукой, ведь они никогда не превзошли бы моих результатов. Но с такими качественными статьями у них был бы шанс...',
        'Ну вот, теперь все знают, как быстро сложить числа от 1 до 100...',
    ],
});
