export default defineCameo({
    name: 'Евклид',
    color: '#846048',
    link: 'https://w.wiki/84za',
    messages: [
        'Я писал учебники по математике, когда это еще не стало мейнстримом!',
        'Была бы такая штука в мое время, не стал бы писать свои «Начала»!',
        'Изложено интереснее и подробнее, чем у меня! Грех не поддержать!',
        'Ну тут-то с пятым постулатом разобрались? Сейчас посмотрим...',
        'Жаль у меня в 300 году до нашей эры такой штуки не было...',
        'Нет царского пути в геометрии! Но есть надежный проводник — «Открытая математика»',
    ],
});
